# IMPUTASI

imputasi adalah mengganti nilai/data yang hilang(missing value;NaN;blank) dengan nilai pengganti.

### Mean

In [2]:
import pandas as pd
import numpy as np

kolom = {'col1': [2, 9, 19],
          'col2':[5, np.nan, 17],
          'col3': [3, 9, np.nan],
          'col4': [6, 0, 9],
          'col5': [np.nan, 7, np.nan]}

data = pd.DataFrame(kolom)

In [3]:
data

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   NaN
1     9   NaN   9.0     0   7.0
2    19  17.0   NaN     9   NaN

In [5]:
#mengganti nilai NaN dengan mean, jika data missing > 5%, jangan pakai mean
data.fillna(data.mean())

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   7.0
1     9  11.0   9.0     0   7.0
2    19  17.0   6.0     9   7.0

In [6]:
data

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6   NaN
1     9   NaN   9.0     0   7.0
2    19  17.0   NaN     9   NaN

In [7]:
# memasukkan dengan nilai suka-suka
data.fillna(99)

   col1  col2  col3  col4  col5
0     2   5.0   3.0     6  99.0
1     9  99.0   9.0     0   7.0
2    19  17.0  99.0     9  99.0

### Arbitrary / nilai suka-suka

In [10]:
umur = {'umur': [29, 43, np.nan, 25, 34, np.nan, 50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [12]:
data.fillna(40)

   umur
0  29.0
1  43.0
2  40.0
3  25.0
4  34.0
5  40.0
6  50.0

### End of Tail

In [13]:
umur = {'umur': [29, 43, np.nan, 25, 34, np.nan, 50]}

data = pd.DataFrame(umur)
data

   umur
0  29.0
1  43.0
2   NaN
3  25.0
4  34.0
5   NaN
6  50.0

In [15]:
pip install feature-engine

Collecting feature-engine
  Downloading feature_engine-1.2.0-py2.py3-none-any.whl (205 kB)
Requirement already satisfied: pandas>=1.0.3 in c:\users\acer\anaconda3\lib\site-packages (from feature-engine) (1.1.3)
Requirement already satisfied: scikit-learn>=0.22.2 in c:\users\acer\anaconda3\lib\site-packages (from feature-engine) (0.23.2)
Requirement already satisfied: numpy>=1.18.2 in c:\users\acer\anaconda3\lib\site-packages (from feature-engine) (1.19.2)
Requirement already satisfied: statsmodels>=0.11.1 in c:\users\acer\anaconda3\lib\site-packages (from feature-engine) (0.12.0)
Requirement already satisfied: scipy>=1.4.1 in c:\users\acer\anaconda3\lib\site-packages (from feature-engine) (1.5.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\acer\anaconda3\lib\site-packages (from pandas>=1.0.3->feature-engine) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\acer\anaconda3\lib\site-packages (from pandas>=1.0.3->feature-engine) (2020.1)
Requirement already satisfied: threadpoolctl>=2.0.0 in c:\users\acer\anaconda3\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (2.1.0)
Requirement already satisfied: joblib>=0.11 in c:\users\acer\anaconda3\lib\site-packages (from scikit-learn>=0.22.2->feature-engine) (0.17.0)
Requirement already satisfied: patsy>=0.5 in c:\users\acer\anaconda3\lib\site-packages (from statsmodels>=0.11.1->feature-engine) (0.5.1)
Requirement already satisfied: six>=1.5 in c:\users\acer\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas>=1.0.3->feature-engine) (1.15.0)
Installing collected packages: feature-engine
Successfully installed feature-engine-1.2.0
Note: you may need to restart the kernel to use updated packages.

In [17]:
#import EndTailImputer
from feature_engine.imputation import EndTailImputer

#buat Imputer
imputer = EndTailImputer(imputation_method='gaussian', tail='right')

#fit-kan imputer ke set
imputer.fit(data)

#ubah data
test_data = imputer.transform(data)

#yuk tampilkan data
test_data

        umur
0  29.000000
1  43.000000
2  66.896905
3  25.000000
4  34.000000
5  66.896905
6  50.000000

Bagaimana dengan data kategorikal?
Kita akan gunakan imputasi modus.

In [21]:
from sklearn.impute import SimpleImputer
mobil = {'mobil':['Ford', 'Ford', 'Toyota', 'Honda', np.nan, 'Toyota', 'Honda', 'Toyota', np.nan, np.nan]}

data = pd.DataFrame(mobil)

In [22]:
data

    mobil
0    Ford
1    Ford
2  Toyota
3   Honda
4     NaN
5  Toyota
6   Honda
7  Toyota
8     NaN
9     NaN

In [24]:
imp = SimpleImputer(strategy='most_frequent')

In [25]:
imp.fit_transform(data)

array([['Ford'],
       ['Ford'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Honda'],
       ['Toyota'],
       ['Toyota'],
       ['Toyota']], dtype=object)

Bagaimana kalau kita butuh untuk mengatasi missing value untuk kategorikal dan numerikal secara bersamaan?

kita bisa gunakan random sample

In [27]:
#import dulu Random Sample
from feature_engine.imputation import RandomSampleImputer

#silakan buat data yang ada missing value-nya

data = {'Jenis Kelamin':['Laki', 'Perempuan', 'Perempuan', 'Laki', np.nan, 'Laki', 'Perempuan', np.nan, 'Laki', np.nan],
        'Umur': [np.nan, '20', np.nan, '11', '55', np.nan, '34', '21', '55', '88' ]}

df = pd.DataFrame(data)

In [28]:
df

  Jenis Kelamin Umur
0          Laki  NaN
1     Perempuan   20
2     Perempuan  NaN
3          Laki   11
4           NaN   55
5          Laki  NaN
6     Perempuan   34
7           NaN   21
8          Laki   55
9           NaN   88

In [29]:
#buat dulu imputer
imp = RandomSampleImputer(random_state=29)

#fit-kan 
imp.fit(df)

#ubah data
testing_df = imp.transform(df)

In [30]:
testing_df

  Jenis Kelamin Umur
0          Laki   55
1     Perempuan   20
2     Perempuan   34
3          Laki   11
4     Perempuan   55
5          Laki   21
6     Perempuan   34
7          Laki   21
8          Laki   55
9          Laki   88